/******************************************************************************
 *
 *  Copyright (C) 2014 Francis Bruno, All Rights Reserved
 * 
 *  This program is free software; you can redistribute it and/or modify it 
 *  under the terms of the GNU General Public License as published by the Free 
 *  Software Foundation; either version 3 of the License, or (at your option) 
 *  any later version.
 *
 *  This program is distributed in the hope that it will be useful, but 
 *  WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY 
 *  or FITNESS FOR A PARTICULAR PURPOSE. 
 *  See the GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License along with
 *  this program; if not, see <http://www.gnu.org/licenses>.
 *
 *  This code is available under licenses for commercial use. Please contact
 *  Francis Bruno for more information.
 *
 *  http://www.gplgpu.com
 *  http://www.asicsolutions.com
 *
 *  Title       :  
 *  File        :  bbird.h
 *  Author      :  Frank Bruno
 *  Created     :  14-May-2011
 *  RCS File    :  $Source:$
 *  Status      :  $Id:$
 *
 ******************************************************************************
 *
 *  Description : 
 *
 *  Header file for test genration
 *
 ******************************************************************************
 *
 *  Modules Instantiated:
 *
 ******************************************************************************
 *

/* General purpose BIOS registers */
#define BBIRD_OFFSET_BIOS1      0x0068
#define BBIRD_OFFSET_BIOS2      0x006C
#define BBIRD_OFFSET_BIOS3      0x0070
#define BBIRD_OFFSET_BIOS4      0x0074

/* IO Mapped DAC registers */
#define BBIRD_OFFSET_DAC               0x0080
#define BBIRD_OFFSET_DAC_WR_ADDR       (BBIRD_OFFSET_DAC+BBIRD_DAC_WR_ADDR)
#define BBIRD_OFFSET_DAC_PAL_DAT       (BBIRD_OFFSET_DAC+BBIRD_DAC_PAL_DAT)
#define BBIRD_OFFSET_DAC_PEL_MASK      (BBIRD_OFFSET_DAC+BBIRD_DAC_PEL_MASK)
#define BBIRD_OFFSET_DAC_RD_ADDR       (BBIRD_OFFSET_DAC+BBIRD_DAC_RD_ADDR)
#define BBIRD_OFFSET_DAC_VPT_INDEX     (BBIRD_OFFSET_DAC+BBIRD_DAC_VPT_INDEX)
#define BBIRD_OFFSET_DAC_VPT_DATA      (BBIRD_OFFSET_DAC+BBIRD_DAC_VPT_DATA)
#define BBIRD_OFFSET_DAC_IBM528_IDXLOW (BBIRD_OFFSET_DAC+BBIRD_DAC_IBM528_IDXLOW)
#define BBIRD_OFFSET_DAC_IBM528_IDXHI  (BBIRD_OFFSET_DAC+BBIRD_DAC_IBM528_IDXHI)
#define BBIRD_OFFSET_DAC_IBM528_DATA   (BBIRD_OFFSET_DAC+BBIRD_DAC_IBM528_DATA)
#define BBIRD_OFFSET_DAC_IBM528_IDXCTL (BBIRD_OFFSET_DAC+BBIRD_DAC_IBM528_IDXCTL)
#define BBIRD_OFFSET_DAC_TI3026_INDEX  (BBIRD_OFFSET_DAC+0x28)
#define BBIRD_OFFSET_DAC_TI3026_DATA   (BBIRD_OFFSET_DAC)

/* Bus type defines */
/* These are the host bus types currently planned to be supported. */
#define BBIRD_BUS_IS_ISA         0x01
#define BBIRD_BUS_IS_EISA        0x02
#define BBIRD_BUS_IS_VL          0x03
#define BBIRD_BUS_IS_PCI         0x04
#define BBIRD_BUS_IS_PAWS        0x05

/* Structure Version Numbers */
/* Each structure must have its own version number to ensure that
   the data being read is interpreted correctly.
   These are the most current version numbers. */
#define BBIRD_FILE_VERSION       0x0100L
#define BBIRD_RES_VERSION        0x0100L
#define BBIRD_MODE_VERSION       0x0100L
#define BBIRD_BUS_VERSION        0x0100L
#define BBIRD_HARDWARE_VERSION   0x0100L
#define BBIRD_VIDEO_VERSION      0x0100L

/* DAC types */
#define BBIRD_DACTYPE_BT485             0x01
#define BBIRD_DACTYPE_BT484             0x02
#define BBIRD_DACTYPE_ATT491            0x03
#define BBIRD_DACTYPE_TIVPT             0x04
#define BBIRD_DACTYPE_TIVPTjr           0x05
#define BBIRD_DACTYPE_IBM528            0x09
#define BBIRD_DACTYPE_IBM524            0x0A
#define BBIRD_DACTYPE_TI3026            0x0B

/* Frequency Types */
#define BBIRD_FREQTYPE_ICD_2061A 0x01
#define BBIRD_FREQTYPE_ICD_2062  0x02

/* Structure's valid data flags */
/* These flags are set within the valid fields in the configuration file */
#define BBIRD_DATA_INVALID       0x0000L
#define BBIRD_DATA_VALID         0x0001L

/* Board selection commands */
#define BBIRD_DEFAULT_BOARD      (-1)

/* Programming defines */
#define BLACKBIRD_ENV            "BBIRD"  /* OS environment variable */
#define BLACKBIRD_CFG_FILE       "BBIRDCFG" /* CFG file name */

/* Macros to extract a major or minor version number from
   the entry within a structure. */
#define BBIRD_MAKEMAJORREV(x)    ((x & 0x0000FF00L)>>8)
#define BBIRD_MAKEMINORREV(x)    (x & 0x000000FFL)

#ifdef I3D
struct Blackbird_Engine
  {
/* This structure is identical to the drawing engine hardware registers */
        long    intrupt;                /* 0x00 */
        long    intrupt_mask;           /* 0x04 */
        long    flow;                   /* 0x08 */
        long    busy;                   /* 0x0C */
        long    xyw_adsz;               /* 0x10 */
        long    reserved_a1;            /* 0x14 */
        long    z_control;              /* 0x18 (unused) */
        long    reserved_a2;            /* 0x1C */
        long    buf_control;            /* 0x20 */
        long    reserved_z2;            /* 0x24 */
        long    src_origin;             /* 0x28 */
        long    dst_origin;             /* 0x2C */
        long    reserved_z3;            /* 0x30 */
        long    reserved_b;             /* 0x34 */
        long    tex_pitch;              /* 0x38 */
        long    zbuf_pitch;             /* 0x3C */
        long    src_pitch;              /* 0x40 */
        long    dst_pitch;              /* 0x44 */
        long    cmd;                    /* 0x48 */
        long    reserved_z5;            /* 0x4C */
        long    cmd_opcode;             /* 0x50 */
        long    cmd_raster_op;          /* 0x54 */
        long    cmd_style;              /* 0x58 */
        long    cmd_pattern;            /* 0x5C */
        long    cmd_clip;               /* 0x60 */
        long    cmd_swap;               /* 0x64 */
        long    foreground;             /* 0x68 */
        long    background;             /* 0x6C */
        long    plane_mask;             /* 0x70 */
        long    de_key;                 /* 0x74 */
        long    line_pattern;           /* 0x78 */
        long    pattern_ctrl;           /* 0x7C */
        long    clip_top_left;          /* 0x80 */
        long    clip_bottom_right;      /* 0x84 */

        long    xy0;                    /* 0x88 */
        long    xy1;                    /* 0x8C */
        long    xy2;                    /* 0x90 */
        long    xy3;                    /* 0x94 */
        long    xy4;                    /* 0x98 */
        long    xy5;                    /* 0x9C */
        long    reserved_x1;            /* 0xA0 */
        long    reserved_x2;            /* 0xA4 */
        long    reserved_x3;            /* 0xA8 */

        long    reserved_x4;            /* 0xAC */
        long    reserved_x5;            /* 0xB0 */

        long    reserved_x6;            /* 0xB4 */
        long    reserved_x7;            /* 0xB8 */
        long    reserved_x8;            /* 0xBC */
        long    reserved_x9;            /* 0xC0 */
        long    reserved_x10;           /* 0xC4 */
        long    reserved_x11;           /* 0xC8 */
        long    reserved_x12;           /* 0xCC */

        long    lod0_sh;                /* 0xD0 */
        long    lod1_sh;                /* 0xD4 */
        long    lod2_sh;                /* 0xD8 */
        long    lod3_sh;                /* 0xDC */
        long    lod4_sh;                /* 0xE0 */
        long    lod5_sh;                /* 0xE4 */
        long    lod6_sh;                /* 0xE8 */
        long    lod7_sh;                /* 0xEC */
        long    lod8_sh;                /* 0xF0 */
        long    lod9_sh;                /* 0xF4 */

        long    dl_addr;                /* 0xF8 */
        long    dl_cntrl;               /* 0xFC */

        long    z_org;                  /* 0x100 */

        long    lod0_org;               /* 0x104 */
        long    lod1_org;               /* 0x108 */
        long    lod2_org;               /* 0x10C */
        long    lod3_org;               /* 0x110 */
        long    lod4_org;               /* 0x114 */

        long    tpalorg;                /* 0x118 */
        long    hith;                   /* 0x11C */
        long    yon;                    /* 0x120 */
        long    fog_col;                /* 0x124 */
        long    alpha;                  /* 0x128 */
        long    reserved_n1;            /* 0x12C */
        long    reserved_n2;            /* 0x130 */
        long    reserved_n3;            /* 0x134 */
        long    reserved_n4;            /* 0x138 */
        long    reserved_n5;            /* 0x13C */
        long    reserved_n6;            /* 0x140 */
        long    reserved_n7;            /* 0x144 */
        long    reserved_n8;            /* 0x148 */
        long    reserved_n9;            /* 0x14C */
        long    reserved_n10;           /* 0x150 */
        long    reserved_n11;           /* 0x154 */
        long    reserved_n12;           /* 0x158 */
        long    reserved_n13;           /* 0x15C */
        long    reserved_n14;           /* 0x160 */
        long    reserved_n15;           /* 0x164 */
        long    cmd2;                   /* 0x168 */
        long    a_cntrl;                /* 0x16C */
        long    i3d_cntrl;              /* 0x170 */
        long    tex_cntrl;              /* 0x174 */

        long    cp0;                    /* 0x178 */
        float   cp1;                    /* 0x17C */
        float   cp2;                    /* 0x180 */
        float   cp3;                    /* 0x184 */
        float   cp4;                    /* 0x188 */
        long    cp5;                    /* 0x18C */
        long    cp6;                    /* 0x190 */
        float   cp7;                    /* 0x194 */
        float   cp8;                    /* 0x198 */
        float   cp9;                    /* 0x19C */
        float   cp10;                   /* 0x1A0 */
        float   cp11;                   /* 0x1A4 */
        float   cp12;                   /* 0x1A8 */
        long    cp13;                   /* 0x1AC */
        long    cp14;                   /* 0x1B0 */
        float   cp15;                   /* 0x1B4 */
        float   cp16;                   /* 0x1B8 */
        float   cp17;                   /* 0x1BC */
        float   cp18;                   /* 0x1C0 */
        float   cp19;                   /* 0x1C4 */
        float   cp20;                   /* 0x1C8 */
        long    cp21;                   /* 0x1CC */
        long    cp22;                   /* 0x1D0 */
        float   cp23;                   /* 0x1D4 */
        float   cp24;                   /* 0x1D8 */
        long    trigger;                /* 0x1DC */
        long    glblendc;               /* 0x1E0 */
        long    cp25;                   /* 0x1E4 */
        long    cp26;                   /* 0x1E8 */
        long    cp27;                   /* 0x1EC */
        long    cp28;                   /* 0x1F0 */
        long    cp29;                   /* 0x1F4 */
        long    cp30;                   /* 0x1F8 */
        long    reserved_o2;            /* 0x1FC */
  };
#else   /* !I3D */
struct Blackbird_Engine
  {
/* This structure is identical to the drawing engine hardware registers */
        long    intrupt;                /* 0x00 */
        long    intrupt_mask;           /* 0x04 */
        long    flow;                   /* 0x08 */
        long    busy;                   /* 0x0C */
        long    xyw_adsz;               /* 0x10 */
        long    reserved_a1;            /* 0x14 */
        long    z_control;              /* 0x18 */
        long    reserved_a2;            /* 0x1C */
        long    buf_control;            /* 0x20 */
        long    page;                   /* 0x24 */
        long    src_origin;             /* 0x28 */
        long    dst_origin;             /* 0x2C */
        long    msk_source;             /* 0x30 */
        long    reserved_b;             /* 0x34 */
        long    key;                    /* 0x38 */
        long    key_data;               /* 0x3C */
        long    src_pitch;              /* 0x40 */
        long    dst_pitch;              /* 0x44 */
        long    cmd;                    /* 0x48 */
        long    cmd_shade;              /* 0x4C */
        long    cmd_opcode;             /* 0x50 */
        long    cmd_raster_op;          /* 0x54 */
        long    cmd_style;              /* 0x58 */
        long    cmd_pattern;            /* 0x5C */
        long    cmd_clip;               /* 0x60 */
        long    cmd_swap;               /* 0x64 */
        long    foreground;             /* 0x68 */
        long    background;             /* 0x6C */
        long    plane_mask;             /* 0x70 */
        long    rop_mask;               /* 0x74 */
        long    line_pattern;           /* 0x78 */
        long    pattern_ctrl;           /* 0x7C */
        long    clip_top_left;          /* 0x80 */
        long    clip_bottom_right;      /* 0x84 */

        long    xy0;                    /* 0x88 */
        long    xy1;                    /* 0x8C */
        long    xy2;                    /* 0x90 */
        long    xy3;                    /* 0x94 */
        long    xy4;                    /* 0x98 */
        long    xy5;                    /* 0x9C */
        long    xy6;                    /* 0xA0 */
        long    xy7;                    /* 0xA4 */
        long    xy8;                    /* 0xA8 */

        long    hither;                 /* 0xAC */
        long    yon;                    /* 0xB0 */

        long    z0;                     /* 0xB4 */
        long    z1;                     /* 0xB8 */
        long    z2;                     /* 0xBC */
        long    z3;                     /* 0xC0 */
        long    z4;                     /* 0xC4 */
        long    z5;                     /* 0xC8 */

        long    color0;                 /* 0xCC */
        long    color1;                 /* 0xD0 */
        long    color2;                 /* 0xD4 */
        long    color3;                 /* 0xD8 */
        long    color4;                 /* 0xDC */
        long    color5;                 /* 0xE0 */
        long    color6;                 /* 0xE4 */
        long    color7;                 /* 0xE8 */
        long    color8;                 /* 0xEC */

        long    reserved_d;             /* 0xF0 */
        long    reserved_e;             /* 0xF4 */
        long    dl_addr;                /* 0xF8 */
        long    dl_cntrl;               /* 0xFC */
  };
#endif  /* !I3D */

struct Blackbird_Copy_Engine
  {
/* This structure is identical to the copy engine hardware registers */
        long    intrupt;                /* 0x00 */
        long    intrupt_mask;           /* 0x04 */
        long    flow;                   /* 0x08 */
        long    busy;                   /* 0x0C */
        long    reserved_c1;            /* 0x10 */
        long    reserved_a1;            /* 0x14 */
        long    reserved_c2;            /* 0x18 */
        long    reserved_a2;            /* 0x1C */
        long    buf_control;            /* 0x20 */
        long    page;                   /* 0x24 */
        long    src_origin;             /* 0x28 */
        long    dst_origin;             /* 0x2C */
        long    msk_source;             /* 0x30 */
        long    reserved_b;             /* 0x34 */
        long    reserved_c3;            /* 0x38 */
        long    reserved_c4;            /* 0x3C */
        long    src_pitch;              /* 0x40 */
        long    dst_pitch;              /* 0x44 */
        long    cmd;                    /* 0x48 */
        long    reserved_c;             /* 0x4C */
        long    cmd_opcode;             /* 0x50 */
        long    reserved_c5;            /* 0x54 */
        long    cmd_interpolate;        /* 0x58 */
        long    reserved_c7;            /* 0x5C */
        long    cmd_clip;               /* 0x60 */
        long    reserved_c8;            /* 0x64 */
        long    reserved_c9;            /* 0x68 */
        long    reserved_ca;            /* 0x6C */
        long    plane_mask;             /* 0x70 */
        long    reserved_cb;            /* 0x74 */
        long    reserved_cc;            /* 0x78 */
        long    reserved_cd;            /* 0x7C */
        long    clip_top_left;          /* 0x80 */
        long    clip_bottom_right;      /* 0x84 */

        long    xy0;/* Source */        /* 0x88 */
        long    xy1;/* Destination */   /* 0x8C */
        long    xy2;/* Extents */       /* 0x90 */
        long    xy3;/* Reserved */      /* 0x94 */
        long    xy4;/* Zoom factors */  /* 0x98 */
  };

struct Blackbird_Memwin
  {
/* This structure is identical to the memory window hardware registers */
        long    control;
        long    address;
        long    size;
        long    page;
        long    origin;
        long    RESERVED;
        long    msk_source;
        long    key;
        long    key_data;
        long    plane_mask;

        /* The following are accessible ONLY from bbird_info.memwins[1] */
        long    flush_count;
        long    flush_trigger;
        long    yuv_address;
        long    yuv_data;
        long    mw_control;
  };

struct Blackbird_Syncs
  {
/* This structure is identical to the display engine hardware registers */
